
/* Properties that, if returned by CGImageSourceGetProperties or 
 * CGImageSourceGetPropertiesAtIndex, contain a dictionary of file-format 
 * or metadata-format specific key-values. */

"{TIFF}"			= "Proprietà TIFF";
"{GIF}"				= "Proprietà GIF";
"{JFIF}"			= "Proprietà JFIF";
"{Exif}"			= "Proprietà Exif";
"{PNG}"				= "Proprietà PNG";
"{IPTC}"			= "Proprietà IPTC";
"{GPS}"				= "Proprietà GPS";
"{Raw}"				= "Proprietà Raw";
"{CIFF}"			= "Proprietà Canon";
"{MakerCanon}"			= "Note creatore Canon";
"{MakerNikon}"			= "Note creatore Nikon";
"{8BIM}"			= "Proprietà di Photoshop";
"{DNG}"				= "Proprietà DNG";


/** Properties which may be returned by "CGImageSourceGetProperties".  The
 ** values apply to the container in general but not necessarily to any
 ** individual image that it contains. **/

"FileSize"			= "Dim. doc.";


/** Properties which may be returned by "CGImageSourceGetPropertiesAtIndex".
 ** The values apply to a single image of an image source file. **/

"DPIHeight"			= "Altezza DPI";
"DPIWidth"			= "Larghezza DPI";
"PixelHeight"			= "Altezza pixel";
"PixelWidth"			= "Larghezza pixel";
"Depth"				= "Profondità";
"Orientation"			= "Orientamento";
"IsFloat"			= "Fluttuante";
"IsIndexed"			= "Indicizzato";
"HasAlpha"			= "Con alfa";
"ColorModel"			= "Modello colore";
"ProfileName"			= "Nome profilo";


/* Possible values for type identifier */

"public.tiff"			= "TIFF";
"public.fax"			= "Fax";
"public.jpeg"			= "JPEG";
"public.jpeg-2000"		= "JPEG-2000";
"public.png"			= "PNG";
"public.radiance"		= "Radiosità";
"public.xbitmap-image"          = "Bitmap X";

"com.apple.pict"		= "PICT";
"com.apple.quicktime-image"	= "QuickTime";
"com.apple.macpaint-image"      = "MacPaint";
"com.apple.icns"		= "ICNS";

"com.adobe.pdf"			= "PDF";
"com.adobe.photoshop-image"	= "Photoshop";

"com.compuserve.gif"		= "gif";
"com.ilm.openexr-image"		= "OpenEXR";
"com.microsoft.ico"		= "ICO";
"com.microsoft.bmp"		= "BMP";
"com.sgi.sgi-image"		= "SGI";
"com.truevision.tga-image"	= "TGA";
"com.kodak.flashpix-image"      = "FlashPix";

"public.camera-raw-image"       = "Raw Camera";
"com.adobe.raw-image"		= "Raw Adobe";
"com.canon.crw-raw-image"       = "Raw Canon CRW";
"com.canon.cr2-raw-image"       = "Raw Canon CR2";
"com.canon.tif-raw-image"       = "Raw Canon TIF";
"com.nikon.raw-image"		= "Raw Nikon";
"com.canon.raw-image"		= "Raw Canon";
"com.olympus.raw-image"		= "Raw Olympus";
"com.fuji.raw-image"		= "Raw Fuji";
"com.sony.raw-image"		= "Raw Sony";
"com.konicaminolta.raw-image"   = "Raw Konica Minolta";
"com.kodak.raw-image"		= "Raw Kodak";
"com.panasonic.raw-image"	= "Raw Panasonic";
"com.leica.raw-image"		= "Raw Leica";


/* Possible values for kCGImagePropertyColorModel property */

"RGB"				= "RGB";
"Gray"				= "Grigio";
"CMYK"				= "CMYK";
"Lab"				= "Lab";


/* Possible keys for kCGImagePropertyTIFFDictionary */

"Compression"			= "Compressione";
"PhotometricInterpretation"	= "Interpretazione fotometrica";
"DocumentName"			= "Nome documento";
"ImageDescription"		= "Descrizione immagine";
"Make"				= "Creazione";
"Model"				= "Modello";
/*"Orientation"			= "Orientation";*/
"XResolution"			= "Risoluzione X";
"YResolution"			= "Risoluzione Y";
"ResolutionUnit"		= "Unità risoluzione";
"Software"			= "Software";
"TransferFunction"		= "Trasferisci funzione";
"DateTime"			= "Data/ora";
"Artist"			= "Artista";
"HostComputer"			= "Computer host";
"Copyright"			= "Copyright";
"WhitePoint"			= "Punto di bianco";
"PrimaryChromaticities"		= "Cromaticità principali";


/* Possible keys for kCGImagePropertyJFIFDictionary */

"JFIFVersion"			= "Versione JFIF";
"XDensity"			= "Densità X";
"YDensity"			= "Densità Y";
"DensityUnit"			= "Unità di densità";


/* Possible keys for kCGImagePropertyExifDictionary */

"ExposureTime"			= "Tempo esposizione";
"FNumber"			= "Numero F";
"ExposureProgram"		= "Programma esposizione";
"SpectralSensitivity"		= "Sensibilità spettrale";
"ISOSpeedRatings"		= "Valutazione velocità ISO";
"OECF"				= "OECF";
"ExifVersion"			= "Versione Exif";
"DateTimeOriginal"		= "Data/Ora originale";
"DateTimeDigitized"		= "Data/Ora digitalizzata";
"ComponentsConfiguration"       = "Configurazione componenti";
"CompressedBitsPerPixel"	= "Bit compressi per pixel";
"ShutterSpeedValue"		= "Valore velocità otturatore";
"ApertureValue"			= "Valore apertura";
"BrightnessValue"		= "Valore luminosità";
"ExposureBiasValue"		= "Valore inclinazione esposizione";
"MaxApertureValue"		= "Valore apertura massima";
"SubjectDistance"		= "Distanza soggetto";
"MeteringMode"			= "Modalità di misurazione";
"LightSource"			= "Sorgente di luce:";
"Flash"				= "Flash";
"FocalLength"			= "Lunghezza focale";
"SubjectArea"			= "Area soggetto";
"MakerNote"			= "Nota creatore";
"UserComment"			= "Commento utente";
"SubsecTime"			= "Tempo \"sub-second\"";
"SubsecTimeOriginal"		= "Tempo \"sub-second\" originale";
"SubsecTimeDigitized"		= "Tempo \"sub-second\" digitalizzato";
"FlashPixVersion"		= "Versione FlashPix";
"ColorSpace"			= "Spazio colore";
"PixelXDimension"		= "Dimensione pixel X";
"PixelYDimension"		= "Dimensione pixel Y";
"RelatedSoundFile"		= "Documento audio correlato";
"FlashEnergy"			= "Energia del flash";
"SpatialFrequencyResponse"      = "Risposta frequenza spaziale";
"FocalPlaneXResolution"		= "Risoluzione X del piano focale";
"FocalPlaneYResolution"		= "Risoluzione Y del piano focale";
"FocalPlaneResolutionUnit"      = "Unità di risoluzione del piano focale";
"SubjectLocation"		= "Posizione soggetto";
"ExposureIndex"			= "Indice esposizione";
"SensingMethod"			= "Metodo di rilevazione";
"FileSource"			= "Sorgente documento";
"SceneType"			= "Tipo di scena";
"CFAPattern"			= "Modello CFA";
"CustomRendered"		= "Elaborato ad hoc";
"ExposureMode"			= "Modalità esposizione";
"WhiteBalance"			= "Bilanciamento bianco";
"DigitalZoomRatio"		= "Rapporto zoom digitale";
"FocalLenIn35mmFilm"		= "Lunghezza focale pellicola 35mm";
"SceneCaptureType"		= "Tipo di acquisizione scena";
"GainControl"			= "Controllo guadagno";
"Contrast"			= "Contrasto";
"Saturation"			= "Saturazione";
"Sharpness"			= "Nitidezza";
"DeviceSettingDescription"      = "Descrizione impostazioni del dispositivo";
"SubjectDistRange"		= "Intervallo distanza soggetto";
"ImageUniqueID"			= "ID unico immagine";
/*"Gamma"			= "Gamma";*/


/* Possible keys for kCGImagePropertyGIFDictionary */

"LoopCount"			= "Conteggio loop";
"DelayTime"			= "Ritardo";
"ImageColorMap"			= "Mappa colori immagine";
"HasGlobalColorMap"		= "Mappa colori Has Global";


/* Possible keys for kCGImagePropertyPNGDictionary */

"Gamma"				= "Gamma";
"InterlaceType"			= "Interlaccia tipo";
"XPixelsPerMeter"		= "X Pixel Per Meter";
"YPixelsPerMeter"		= "Pixel per metro Y";
"sRGBIntent"			= "Intento sRGB";
"Chromaticities"		= "Cromaticità";


/* Possible keys for kCGImagePropertyGPSDictionary */

"GPSVersion"			= "Versione GPS";
"LatitudeRef"			= "Riferimento latitudine";
"Latitude"			= "Latitudine";
"LongitudeRef"			= "Riferimento longitudine";
"Longitude"			= "Longitudine";
"AltitudeRef"			= "Riferimento altitudine";
"Altitude"			= "Altitudine";
"TimeStamp"			= "Timbro ora";
"Satellites"			= "Satelliti";
"Status"			= "Stato";
"MeasureMode"			= "Modalità di misura";
"DOP"				= "Grado di precisione";
"SpeedRef"			= "Riferimento velocità";
"Speed"				= "Velocità";
"TrackRef"			= "Riferimento traccia";
"Track"				= "Traccia";
"ImgDirectionRef"		= "Riferimento direzione immagine";
"ImgDirection"			= "Direzione immagine";
"MapDatum"			= "Dato mappa";
"DestLatitudeRef"		= "Riferimento latitudine di destinazione";
"DestLatitude"			= "Latitudine destinazione";
"DestLongitudeRef"		= "Riferimento longitudine di destinazione";
"DestLongitude"			= "Longitudine di destinazione";
"DestBearingRef"		= "Riferimento orientamento di destinazione";
"DestBearing"			= "Orientamento di destinazione";
"DestDistanceRef"		= "Riferimento distanza di destinazione";
"DestDistance"			= "Distanza di destinazione";
"ProcessingMethod"		= "Metodo di processo";
"AreaInformation"		= "Informazioni area";
"DateStamp"			= "Data timbro";
"Differential"			= "Differenziale";


/* Possible keys for kCGImagePropertyIPTCDictionary */

"ObjectTypeReference"		= "Riferimento tipo oggetto";
"ObjectAttributeReference"	= "Riferimento attributo oggetto";
"ObjectName"			= "Nome oggetto";
"EditStatus"			= "Stato di modifica";
"EditorialUpdate"		= "Aggiornamento editoriale";
"Urgency"			= "Urgente";
"SubjectReference"		= "Riferimento soggetto";
"Category"			= "Categoria";
"SupplementalCategory"		= "Categoria supplementare";
"FixtureIdentifier"		= "Identificatore apparecchiatura";
"Keywords"			= "Parole chiave";
"ContentLocationCode"		= "Codice posizione contenuto";
"ContentLocationName"		= "Nome posizione contenuto";
"ReleaseDate"			= "Data di rilascio";
"ReleaseTime"			= "Tempo di rilascio";
"ExpirationDate"		= "Data scadenza";
"ExpirationTime"		= "Ora scadenza";
"SpecialInstructions"		= "Istruzioni speciali";
"ActionAdvised"			= "Azione consigliata";
"ReferenceService"		= "Servizio di riferimento";
"ReferenceDate"			= "Data di riferimento";
"ReferenceNumber"		= "Numero di riferimento";
"DateCreated"			= "Data creazione";
"TimeCreated"			= "Ora di creazione";
"DigitalCreationDate"		= "Data di creazione digitale";
"DigitalCreationTime"		= "Ora di creazione digitale";
"OriginatingProgram"		= "Programma di origine";
"ProgramVersion"		= "Versione programma";
"ObjectCycle"			= "Ciclo oggetto";
"Byline"			= "Byline";
"BylineTitle"			= "Titolo byline";
"City"				= "Città";
"SubLocation"			= "Sotto-posizione";
"Province/State"		= "Provincia / Stato";
"Country/PrimaryLocationCode"	= "Paese / Codice indirizzo primario";
"Country/PrimaryLocationName"	= "Paese / Nome indirizzo primario";
"OriginalTransmissionReference"	= "Riferimento trasmissione originale";
"Headline"			= "Intestazione";
"Credit"			= "Credito";
"Source"			= "Sorgente";
"CopyrightNotice"		= "Nota copyright";
"Contact"			= "Contatto";
"Caption/Abstract"		= "Didascalia / Astratto";
"Writer/Editor"			= "Scrittore / Editor";
"ImageType"			= "Tipo immagine";
"ImageOrientation"		= "Orientamento immagine";
"LanguageIdentifier"		= "Identificatore lingua";


/* Possible keys for kCGImageProperty8BIMDictionary */

"LayerNames"			= "Nomi del livello";


/* Possible keys for kCGImagePropertyDNGDictionary */

"DNGVersion"			= "Versione DNG";
"DNGBackwardVersion"		= "Versione DNG compatibile all'indietro";
"UniqueCameraModel"		= "Modello fotocamera unico";
"LocalizedCameraModel"		= "Modello fotocamera localizzato";
"CameraSerialNumber"		= "Numero di serie fotocamera";
"LensInfo"			= "Informazioni lente";


/* Possible keys for kCGImagePropertyCIFFDictionary */

"Description"			= "Descrizione";
"Firmware"			= "Firmware";
"OwnerName"			= "Nome proprietario";
"ImageName"			= "Nome immagine";
"ImageFileName"			= "Nome documento immagine";
"ReleaseMethod"			= "Metodo di scatto";
"ReleaseTiming"			= "Tempo di scatto";
"RecordID"			= "ID registrazione";
"SelfTimingTime"		= "Tempo auto temporizzatore";
/*"CameraSerialNumber"		= "Camera Serial Number";*/
"ImageSerialNumber"		= "Numero di serie immagine";
"ContinuousDrive"		= "Ripresa continua";
"FocusMode"			= "Modalità di messa a fuoco";
/*"MeteringMode"		= "Metering Mode";*/
"ShootingMode"			= "Modalità di ripresa";
"LensMaxMM"			= "Lente MM max";
"LensMinMM"			= "Lente MM min";
"WhiteBalanceIndex"		= "Indice di bilanciamento del bianco";
"FlashExposureComp"		= "Compensazione esposizione flash";
"MeasuredEV"			= "EV misurato";

/* Possible keys for kCGImagePropertyMakerNikonDictionary */

"ISOSetting"			= "Impostazione ISO";
"ColorMode"			= "Modalità colore";
"Quality"			= "Qualità";
"WhiteBalanceMode"		= "Modalità bilanciamento del bianco";
"SharpenMode"			= "Modalità Nitidezza";
/*"FocusMode"			= "Focus Mode";*/
"FlashSetting"			= "Impostazione flash";
"ISOSelection"			= "Selezione ISO";
/*"FlashExposureComp"		= "Flash Exposure Compensation";*/
"ImageAdjustment"		= "Regolazione immagine";
"LensAdapter"			= "Adattatore lente";
"FocusDistance"			= "Distanza di messa a fuoco";
"DigitalZoom"			= "Zoom digitale";
/*"ShootingMode"		= "Shooting Mode";*/
/*"CameraSerialNumber"		= "Camera Serial Number";*/

/* Possible keys for kCGImagePropertyMakerCanonDictionary */

/*"OwnerName"			= "Owner Name";*/
/*"CameraSerialNumber"		= "Camera Serial Number";*/
/*"ImageSerialNumber"		= "Image Serial Number";*/
/*"FlashExposureComp"		= "Flash Exposure Compensation";*/
/*"ContinuousDrive"		= "Continuous Drive";*/
